NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_wificore.svd
        <cluster>
          <name>ACTIVESHIELD</name>
          <description>Unspecified</description>
          <headerStructName>TAMPC_ACTIVESHIELD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x404</addressOffset>
          <register>
            <name>CHEN</name>
            <description>Active shield detector channel enable register.</description>
            <addressOffset>0x0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CH_0</name>
                <description>Enable or disable active shield channel 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable channel.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable channel.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CH_1</name>
                <description>Enable or disable active shield channel 1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable channel.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable channel.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CH_2</name>
                <description>Enable or disable active shield channel 2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable channel.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable channel.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CH_3</name>
                <description>Enable or disable active shield channel 3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable channel.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable channel.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PROTECT</name>
          <description>Unspecified</description>
          <headerStructName>TAMPC_PROTECT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <cluster>
            <dim>1</dim>
            <dimIncrement>0x020</dimIncrement>
            <name>DOMAIN[%s]</name>
            <description>Unspecified</description>
            <headerStructName>TAMPC_PROTECT_DOMAIN</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <cluster>
              <name>DBGEN</name>
              <description>Unspecified</description>
              <headerStructName>TAMPC_PROTECT_DOMAIN_DBGEN</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <register>
                <name>CTRL</name>
                <description>Description cluster: Control register for invasive (halting) debug enable for the local debug components within domain n.</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000010</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Set value of dbgen signal.</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Low</name>
                        <description>Signal is logic 0, indicating that invasive debug is disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>High</name>
                        <description>Signal is logic 1, indicating that invasive debug is enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                    <lsb>1</lsb>
                    <msb>1</msb>
                    <access>writeonce</access>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Lock disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Lock enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>WRITEPROTECTION</name>
                    <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                    <lsb>4</lsb>
                    <msb>7</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Read: Write protection is disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Read: Write protection is enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Clear</name>
                        <description>Write: Value to clear write protection.</description>
                        <value>0xF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>KEY</name>
                    <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                    <lsb>16</lsb>
                    <msb>31</msb>
                    <access>write-only</access>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>KEY</name>
                        <description>Write key value.</description>
                        <value>0x50FA</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>STATUS</name>
                <description>Description cluster: Status register for invasive (halting) debug enable for domain n.</description>
                <addressOffset>0x004</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>ERROR</name>
                    <description>Error detection status.</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NoError</name>
                        <description>No error detected.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Error</name>
                        <description>Error detected.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>NIDEN</name>
              <description>Unspecified</description>
              <headerStructName>TAMPC_PROTECT_DOMAIN_NIDEN</headerStructName>
              <access>read-write</access>
              <addressOffset>0x008</addressOffset>
              <register>
                <name>CTRL</name>
                <description>Description cluster: Control register for non-invasive debug enable for the local debug components within domain n.</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000010</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Set value of niden signal.</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Low</name>
                        <description>Signal is logic 0, indicating that non-invasive debug is disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>High</name>
                        <description>Signal is logic 1, indicating that non-invasive debug is enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                    <lsb>1</lsb>
                    <msb>1</msb>
                    <access>writeonce</access>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Lock disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Lock enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>WRITEPROTECTION</name>
                    <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                    <lsb>4</lsb>
                    <msb>7</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Read: Write protection is disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Read: Write protection is enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Clear</name>
                        <description>Write: Value to clear write protection.</description>
                        <value>0xF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>KEY</name>
                    <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                    <lsb>16</lsb>
                    <msb>31</msb>
                    <access>write-only</access>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>KEY</name>
                        <description>Write key value.</description>
                        <value>0x50FA</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>STATUS</name>
                <description>Description cluster: Status register for non-invasive debug enable for domain n.</description>
                <addressOffset>0x004</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>ERROR</name>
                    <description>Error detection status.</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NoError</name>
                        <description>No error detected.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Error</name>
                        <description>Error detected.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>SPIDEN</name>
              <description>Unspecified</description>
              <headerStructName>TAMPC_PROTECT_DOMAIN_SPIDEN</headerStructName>
              <access>read-write</access>
              <addressOffset>0x010</addressOffset>
              <register>
                <name>CTRL</name>
                <description>Description cluster: Control register for secure priviliged invasive (halting) debug enable for the local debug components within domain n.</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000010</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Set value of spiden signal.</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Low</name>
                        <description>Signal is logic 0, indicating that secure priviliged invasive debug is disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>High</name>
                        <description>Signal is logic 1, indicating that secure priviliged invasive debug is enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>LOCK</name>
                    <description>Lock this register to prevent changes to the VALUE field until next reset.</description>
                    <lsb>1</lsb>
                    <msb>1</msb>
                    <access>writeonce</access>
                    <modifiedWriteValues>oneToSet</modifiedWriteValues>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Lock disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Lock enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>WRITEPROTECTION</name>
                    <description>The write protection must be cleared to allow updates to the VALUE field.</description>
                    <lsb>4</lsb>
                    <msb>7</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>Disabled</name>
                        <description>Read: Write protection is disabled.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Enabled</name>
                        <description>Read: Write protection is enabled.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Clear</name>
                        <description>Write: Value to clear write protection.</description>
                        <value>0xF</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>KEY</name>
                    <description>Required write key for upper 16 bits. Must be included in all register write operations.</description>
                    <lsb>16</lsb>
                    <msb>31</msb>
                    <access>write-only</access>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>KEY</name>
                        <description>Write key value.</description>
                        <value>0x50FA</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
              <register>
                <name>STATUS</name>
                <description>Description cluster: Status register for secure priviliged invasive (halting) debug enable for domain n.</description>
                <addressOffset>0x004</addressOffset>
                <access>read-write</access>
                <resetValue>0x00000000</resetValue>
                <modifiedWriteValues>oneToClear</modifiedWriteValues>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>ERROR</name>
                    <description>Error detection status.</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NoError</name>
                        <description>No error detected.</description>
                        <value>0x0</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Error</name>
                        <description>Error detected.</description>
                        <value>0x1</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                </fields>
              </register>
            </cluster>
